{
	"en": {
		"0": "Pedestrians may only cross the road at places with traffic lights, pedestrian crossings, or pedestrian overpasses/underpasses and must obey traffic signals. (Article 30.1.b of the 2024 Road Traffic Safety Law)",
		"1": "If there are no traffic lights, pedestrian crossings, or pedestrian overpasses/underpasses, pedestrians must observe oncoming vehicles and only cross when it is safe to do so, using hand signals when crossing. (Article 30.1.b of the 2024 Road Traffic Safety Law)",
		"2": "Pedestrians must not cross medians, climb on, or hold onto moving vehicles. (Article 30.1.c of the 2024 Road Traffic Safety Law)",
		"3": "Pedestrians are not allowed on expressways, except for road maintenance and management personnel and vehicles. (Article 25.3 of the 2024 Road Traffic Safety Law)",
		"4": "A fine of VND 150,000 to VND 250,000 will be imposed on pedestrians who do not walk in the designated area; cross medians; cross the road at undesignated locations; or cross the road without using hand signals as required. (Article 10.1.a of Decree 168/2024/ND-CP)",
		"5": "A fine of VND 150,000 to VND 250,000 will be imposed on pedestrians who do not comply with traffic lights, road signs, or road markings. (Article 10.1.b of Decree 168/2024/ND-CP)",
		"6": "A fine of VND 150,000 to VND 250,000 will be imposed on pedestrians who do not comply with the instructions of traffic controllers or traffic monitors. (Article 10.1.c of Decree 168/2024/ND-CP)",
		"7": "A fine of VND 400,000 to VND 600,000 will be imposed on pedestrians who enter expressways, except for road maintenance and management personnel; or pedestrians who climb on or hold onto moving vehicles. (Articles 10.2.a and 10.2.c of Decree 168/2024/ND-CP)"
	},
	"vi": {
		"0": "Người đi bộ chỉ được qua đường ở những nơi có đèn tín hiệu, có vạch kẻ đường hoặc có cầu vượt, hầm dành cho người đi bộ và phải tuân thủ tín hiệu chỉ dẫn, báo hiệu đường bộ. (Điều 30.1.b Luật Trật tự an toàn giao thông đường bộ 2024)",
		"1": "Trường hợp không có đèn tín hiệu, vạch kẻ đường, cầu vượt, hầm dành cho người đi bộ, người đi bộ phải quan sát các xe đang đi tới, chỉ qua đường khi bảo đảm an toàn, khi qua đường phải có tín hiệu bằng tay (Điều 30.1.b Luật Trật tự an toàn giao thông đường bộ 2024)",
		"2": "Người đi bộ không được vượt qua dải phân cách, đu, bám vào phương tiện giao thông đường bộ đang di chuyển (Điều 30.1.c Luật Trật tự an toàn giao thông đường bộ 2024)",
		"3": "Người đi bộ không được đi trên đường cao tốc, trừ người, phương tiện giao thông đường bộ và thiết bị phục vụ việc quản lý, bảo trì đường cao tốc. (Điều 25.3 Luật Trật tự an toàn giao thông đường bộ 2024)",
		"4": "Phạt tiền từ 150.000 đồng đến 250.000 đồng đối với người đi bộ không đi đúng phần đường quy định; vượt qua dải phân cách; đi qua đường không đúng nơi quy định; đi qua đường không có tín hiệu bằng tay theo quy định. (Điều 10.1.a Nghị định 168/2024/NĐ-CP)",
		"5": "Phạt tiền từ 150.000 đồng đến 250.000 đồng đối với người đi bộ không chấp hành hiệu lệnh hoặc chỉ dẫn của đèn tín hiệu, biển báo hiệu, vạch kẻ đường (Điều 10.1.b Nghị định 168/2024/NĐ-CP)",
		"6": "Phạt tiền từ 150.000 đồng đến 250.000 đồng đối với người đi bộ không chấp hành hiệu lệnh, hướng dẫn của người điều khiển giao thông hoặc người kiểm soát giao thông. (Điều 10.1.c Nghị định 168/2024/NĐ-CP)",
		"7": "Phạt tiền từ 400.000 đồng đến 600.000 đồng đối với người đi bộ đi vào đường cao tốc, trừ người phục vụ việc quản lý, bảo trì đường cao tốc; người đi bộ đu, bám vào phương tiện giao thông đang chạy. (Điều 10.2.a, 10.2.c Nghị định 168/2024/NĐ-CP)"
	}
}
